
&НаСервере
Процедура ОбновлениеИнформации()
	Объект.ТабДокОснСредства.Очистить();   
	МассивДанных = ПолучитьЗаписиРегистра(Объект.Помещение);
	Для Каждого Стр Из МассивДанных Цикл 
		СтрокаТЧ = Объект.ТабДокОснСредства.Добавить();
		СтрокаТЧ.ОсновноеСредство = Стр.ОсновноеСредство;
		СтрокаТЧ.ИнвНомер = Стр.ИнвНомер;
		СтрокаТЧ.Стоимость = Стр.Стоимость;
		СтрокаТЧ.Состояние = Стр.Состояние;    
		СтрокаТЧ.НаличиеПоДаннымУчета = Стр.НаличиеПоДаннымУчета;
	КонецЦикла;
КонецПроцедуры  

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	ОбновлениеИнформации();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаписиРегистра(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст =                    	
	"ВЫБРАТЬ
	|	Имущество.Ссылка КАК ОсновноеСредство,
	|	Имущество.Код КАК ИнвНомер,
	|	Имущество.Наименование КАК Наименование,
	|	Имущество.Стоимость КАК Стоимость,
	|	Имущество.Состояние КАК Состояние,
	|	Имущество.НаличиеПоДаннымУчета КАК НаличиеПоДаннымУчета
	|ИЗ
	|	Справочник.Имущество КАК Имущество
	|ГДЕ
	|	Имущество.Помещение = &Помещение
	|	И Имущество.Состояние <> &Списанное
	|	И Имущество.Состояние <> &Утеряно";    
	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("Списанное", Перечисления.Состояния.Списанное); 
	Запрос.УстановитьПараметр("Утеряно", Перечисления.Состояния.Утеряно); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("ОсновноеСредство",ВыборкаДетальныеЗаписи.ОсновноеСредство);
		Данные.Вставить("ИнвНомер",ВыборкаДетальныеЗаписи.ИнвНомер);
		Данные.Вставить("Наименование",ВыборкаДетальныеЗаписи.Наименование);
		Данные.Вставить("Стоимость",ВыборкаДетальныеЗаписи.Стоимость);   
		Данные.Вставить("Состояние",ВыборкаДетальныеЗаписи.Состояние); 
		Данные.Вставить("НаличиеПоДаннымУчета",ВыборкаДетальныеЗаписи.НаличиеПоДаннымУчета);
		МассивДанных.Добавить(Данные);
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)                                             
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.УчетДвиженийИмущества.СоздатьНаборЗаписей();   
	НачатьТранзакцию();
	Для Каждого ТК Из ТекущийОбъект.ТабДокОснСредства Цикл
		ОсновноеСредство = ТК.ОсновноеСредство.ПолучитьОбъект();
		                                                  
		Если ТК.ФактическоеНаличие = ИСТИНА тогда
			ОсновноеСредство.Состояние = ТК.Состояние;
		Иначе 
			ОсновноеСредство.Состояние = Перечисления.Состояния.Утеряно;      
			ОсновноеСредство.НаличиеПоДаннымУчета = ТК.ФактическоеНаличие;
		КонецЕсли;
		ОсновноеСредство.Записать();
		
		История.Прочитать();
		ЗаписьИстории = История.Добавить();
		ЗаписьИстории.Период = Объект.ПериодПо;
		ЗаписьИстории.Имущество = ОсновноеСредство.Ссылка;
		ЗаписьИстории.ИнвНомер = ОсновноеСредство.Код;
		ЗаписьИстории.Помещение = ОсновноеСредство.Помещение; 
		ЗаписьИстории.Состояние = ОсновноеСредство.Состояние;  
		ЗаписьИстории.Комментарий = Объект.Комментарий; 
		История.Записать();
			
	КонецЦикла;
    ЗафиксироватьТранзакцию();
КонецПроцедуры
