
&НаКлиенте
Процедура ТабДокОснСредстваОсновноеСредствоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабДокОснСредства.ТекущиеДанные;
	СтрокаТабличнойЧасти.ИнвНомер = ПолучитьДанные(СтрокаТабличнойЧасти.ОсновноеСредство);
КонецПроцедуры   

Функция ПолучитьДанные(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	Имущество.Код КАК Код
	|ИЗ
	|	Справочник.Имущество КАК Имущество
	|ГДЕ
	|	Имущество.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Код;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.УчетДвиженийИмущества.СоздатьНаборЗаписей();        
	НачатьТранзакцию();
	Для Каждого Актив Из ТекущийОбъект.ТабДокОснСредства Цикл
		ОсновноеСредство = Актив.ОсновноеСредство.ПолучитьОбъект();
		ОсновноеСредство.Состояние = Перечисления.Состояния.Списанное;   
		ОсновноеСредство.НаличиеПоДаннымУчета = ЛОЖЬ;
		ОсновноеСредство.Записать();   
		
		История.Прочитать();
		ЗаписьИстории = История.Добавить();
		ЗаписьИстории.Период = Объект.ДатаСписания;
		ЗаписьИстории.Имущество = ОсновноеСредство.Ссылка;
		ЗаписьИстории.ИнвНомер = ОсновноеСредство.Код;
		ЗаписьИстории.Помещение = ОсновноеСредство.Помещение; 
		ЗаписьИстории.Состояние = ОсновноеСредство.Состояние;
		ЗаписьИстории.Комментарий = Актив.ПричинаСписания;  
		История.Записать();
	КонецЦикла;             
	ЗафиксироватьТранзакцию();
КонецПроцедуры

